# Chapter 1

## Introduction DataFrames

In [1]:
print("hellow, world!")

hellow, world!

In [5]:
import pandas as pd

dict = {
    "Name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "Breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "Color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "Whiite"],
    "Height (cm)": [56, 43, 46, 49, 59, 18, 77],
    "Weight (kg)": [25, 23, 22, 17, 29, 2, 74],
    "Date of Birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

dogs = pd.DataFrame(dict)

# Exploring a DataFrame: .head()
print(dogs.head())

# Exploring a DataFramne: .info()
print(dogs.info())

# Exploring a DataFramne: .shape()
print(dogs.shape)

# Exploring a DataFramne: .describe()
print(dogs.describe())

# Components of a DataFrame: .values
print(dogs.values)

# Components of DataFrame: .columns and .index
print(dogs.columns)
print(dogs.index)

      Name       Breed  Color  Height (cm)  Weight (kg) Date of Birth
0    Bella    Labrador  Brown           56           25    2013-07-01
1  Charlie      Poodle  Black           43           23    2016-09-16
2     Lucy   Chow Chow  Brown           46           22    2014-08-25
3   Cooper   Schnauzer   Gray           49           17    2011-12-11
4      Max    Labrador  Black           59           29    2017-01-20
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height (cm)    7 non-null      int64
 4   Weight (kg)    7 non-null      int64
 5   Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes
None
(7, 6)
       Height (cm)  Weight (kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000
[['Bella' 'Labrador' 'Brown' 56 25 '2013-07-01']
 ['Charlie' 'Poodle' 'Black' 43 23 '2016-09-16']
 ['Lucy' 'Chow Chow' 'Brown' 46 22 '2014-08-25']
 ['Cooper' ' Schnauzer' 'Gray' 49 17 '2011-12-11']
 ['Max' 'Labrador' 'Black' 59 29 '2017-01-20']
 ['Stella' 'Chihuahua' 'Tan' 18 2 '2015-04-20']
 ['Bernie' 'St. Bernard' 'Whiite' 77 74 '2018-02-27']]
Index(['Name', 'Breed', 'Color', 'Height (cm)', 'Weight (kg)',
       'Date of Birth'],
      dtype='object')
RangeIndex(start=0, stop=7, step=1)

In [ ]:
#homelessness = []

# Print the head of the homelessness data
#print(homelessness.head())

# Print information about homelessness
#print(homelessness.info())

# Print the shape of homelessness
#print(homelessness.shape)

# Print a description of homelessness
#print(homelessness.describe())

In [ ]:
# Import pandas using the alias pd
#import pandas as pd

# Print the values of homelessness
#print(homelessness.values)

# Print the column index of homelessness
#print(homelessness.columns)

# Print the row index of homelessness
#print(homelessness.index)

## Sorting

In [8]:
dict = {
    "name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "Whiite"],
    "height_cm": [56, 43, 46, 49, 59, 18, 77],
    "weight_kg": [25, 23, 22, 17, 29, 2, 74],
    "date_of_birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

dogs = pd.DataFrame(dict)

# Sorting
dogs.sort_values("weight_kg")

# Sorting in descending order
dogs.sort_values("weight_kg", ascending=False)

# Sorting by multiple variables
dogs.sort_values(["weight_kg", "height_cm"])

# Sorting by multiple variables
dogs.sort_values(["weight_kg", "height_cm"], ascending=[True, False])

      name        breed   color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua     Tan         18          2    2015-04-20
3   Cooper    Schnauzer    Gray         49         17    2011-12-11
2     Lucy    Chow Chow   Brown         46         22    2014-08-25
1  Charlie       Poodle   Black         43         23    2016-09-16
0    Bella     Labrador   Brown         56         25    2013-07-01
4      Max     Labrador   Black         59         29    2017-01-20
6   Bernie  St. Bernard  Whiite         77         74    2018-02-27

In [9]:
# Subsetting columns
dogs["name"]

0      Bella
1    Charlie
2       Lucy
3     Cooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object

In [11]:
# Subsetting multiple columns
dogs[["breed", "height_cm"]]

# or we can use
cols_to_subset = ["breed", "height_cm"]
dogs[cols_to_subset]

         breed  height_cm
0     Labrador         56
1       Poodle         43
2    Chow Chow         46
3    Schnauzer         49
4     Labrador         59
5    Chihuahua         18
6  St. Bernard         77

In [15]:
# Subsetting rows
dogs[dogs["height_cm"] > 50]

# based on text data
dogs[dogs["breed"] == "Labrador"]

# based on dates
dogs[dogs["date_of_birth"] < "2015-01-01"]

     name       breed  color  height_cm  weight_kg date_of_birth
0   Bella    Labrador  Brown         56         25    2013-07-01
2    Lucy   Chow Chow  Brown         46         22    2014-08-25
3  Cooper   Schnauzer   Gray         49         17    2011-12-11

In [17]:
# Subsetting based on multiple conditions
is_label = dogs["breed"] == "Labrador"
is_brown = dogs["color"] == "Brown"
dogs[is_label & is_brown]

# or we can use
dogs[ (dogs["breed"] == "Labrador") & (dogs["color"] == "Brown") ]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         25    2013-07-01

In [18]:
# Subsetting using .isin()
is_black_or_brown = dogs["color"].isin(["Black", "Brown"])
dogs[is_black_or_brown]

      name      breed  color  height_cm  weight_kg date_of_birth
0    Bella   Labrador  Brown         56         25    2013-07-01
1  Charlie     Poodle  Black         43         23    2016-09-16
2     Lucy  Chow Chow  Brown         46         22    2014-08-25
4      Max   Labrador  Black         59         29    2017-01-20

In [19]:
# Subset for rows in South Atlantic or Mid-Atlantic regions
#south_mid_atlantic = homelessness[homelessness["region"].isin(["South Atlantic", "Mid-Atlantic"])]

# See the result
#print(south_mid_atlantic)

In [20]:
# The Mojave Desert states
#canu = ["California", "Arizona", "Nevada", "Utah"]

# Filter for rows in the Mojave Desert states
#mojave_homelessness = homelessness[homelessness["state"].isin(canu)]

# See the result
#print(mojave_homelessness)

## New Columns

In [22]:
dict = {
    "name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "Whiite"],
    "height_cm": [56, 43, 46, 49, 59, 18, 77],
    "weight_kg": [25, 23, 22, 17, 29, 2, 74],
    "date_of_birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

dogs = pd.DataFrame(dict)

# Adding a new column
dogs["height_m"] = dogs["height_cm"] / 100
print(dogs)

      name        breed   color  height_cm  weight_kg date_of_birth  height_m
0    Bella     Labrador   Brown         56         25    2013-07-01      0.56
1  Charlie       Poodle   Black         43         23    2016-09-16      0.43
2     Lucy    Chow Chow   Brown         46         22    2014-08-25      0.46
3   Cooper    Schnauzer    Gray         49         17    2011-12-11      0.49
4      Max     Labrador   Black         59         29    2017-01-20      0.59
5   Stella    Chihuahua     Tan         18          2    2015-04-20      0.18
6   Bernie  St. Bernard  Whiite         77         74    2018-02-27      0.77

In [23]:
# Doggy mass index
dogs["bmi"] = dogs["weight_kg"] / dogs["height_m"] ** 2
print(dogs.head())

      name       breed  color  height_cm  weight_kg date_of_birth  height_m  \
0    Bella    Labrador  Brown         56         25    2013-07-01      0.56
1  Charlie      Poodle  Black         43         23    2016-09-16      0.43
2     Lucy   Chow Chow  Brown         46         22    2014-08-25      0.46
3   Cooper   Schnauzer   Gray         49         17    2011-12-11      0.49
4      Max    Labrador  Black         59         29    2017-01-20      0.59

          bmi
0   79.719388
1  124.391563
2  103.969754
3   70.803832
4   83.309394

In [24]:
# Multiple manipulations
bmi_lt_100 = dogs[dogs["bmi"] < 100]
bmi_lt_100_height = bmi_lt_100.sort_values("height_cm", ascending=False)
bmi_lt_100_height[["name", "height_cm", "bmi"]]

     name  height_cm        bmi
4     Max         59  83.309394
0   Bella         56  79.719388
3  Cooper         49  70.803832
5  Stella         18  61.728395

In [25]:
# Add total col as sum of individuals and family_members
#homelessness["total"] = homelessness["individuals"] + homelessness["family_members"]

# Add p_individuals col as proportion of total that are individuals
#homelessness["p_individuals"] = homelessness["individuals"] / homelessness["total"]

# See the result
#print(homelessness)

In [ ]:
# Create indiv_per_10k col as homeless individuals per 10k state pop
#homelessness["indiv_per_10k"] = 10000 * homelessness["individuals"] / homelessness["state_pop"]

# Subset rows for indiv_per_10k greater than 20
#high_homelessness = homelessness[homelessness["indiv_per_10k"] > 20]

# Sort high_homelessness by descending indiv_per_10k
#high_homelessness_srt = high_homelessness.sort_values("indiv_per_10k", ascending =  False)

# From high_homelessness_srt, select the state and indiv_per_10k cols
#result = high_homelessness_srt[["state", "indiv_per_10k"]]

# See the result
#print(result)

# Chapter 2

## Summary Statistics

In [32]:
import pandas as pd

dict = {
    "name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "Whiite"],
    "height_cm": [56, 43, 46, 49, 59, 18, 77],
    "weight_kg": [25, 23, 22, 17, 29, 2, 74],
    "date_of_birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

# Summarizing numerical data
dogs = pd.DataFrame(dict)

print("=== Summary Dogs \"height_cm\" Column ===")
print("mean : " + str(dogs["height_cm"].mean()))
print("median : " + str(dogs["height_cm"].median()))
print("mode : " + str(dogs["height_cm"].mode()))
print("min : " + str(dogs["height_cm"].min()))
print("max : " + str(dogs["height_cm"].max()))
print("var : " + str(dogs["height_cm"].var()))
print("std : " + str(dogs["height_cm"].std()))
print("quantile : " + str(dogs["height_cm"].quantile()))

=== Summary Dogs "height_cm" Column ===
mean : 49.714285714285715
median : 49.0
mode : 0    18
1    43
2    46
3    49
4    56
5    59
6    77
Name: height_cm, dtype: int64
min : 18
max : 77
var : 322.5714285714286
std : 17.960273621841864
quantile : 49.0

In [33]:
# Summirizing dates
# Oldest dog:
print("Oldest Dog : " + str(dogs["date_of_birth"].min()))
# Youngest dog:
print("Youngest Dog : " + str(dogs["date_of_birth"].max()))

Oldest Dog : 2011-12-11
Youngest Dog : 2018-02-27

In [37]:
# The .agg() method
def pct30(column):
    return column.quantile(0.3)

def pct40(column):
    return column.quantile(0.4)

dogs["weight_kg"].agg(pct30)
dogs[["weight_kg", "height_cm"]].agg(pct30)

# Multiple summaries
dogs["weight_kg"].agg([pct30, pct40])

pct30    21.0
pct40    22.4
Name: weight_kg, dtype: float64

In [43]:
# Cumulative sum
dogs["weight_kg"]
dogs["weight_kg"].cumsum()

# Cumulative statistics
dogs["weight_kg"].cummax()
dogs["weight_kg"].cummin()
dogs["weight_kg"].cumprod()

0           25
1          575
2        12650
3       215050
4      6236450
5     12472900
6    922994600
Name: weight_kg, dtype: int64

In [16]:
import pandas as pd

dict = {
    "store": [1, 1, 1, 1, 1],
    "type": ["A", "A", "A", "A", "A"],
    "dept": [1, 2, 3, 4, 5],
    "date_of_birth": ["2010-02-05", "2010-02-05", "2010-02-05", "2010-02-05", "2010-02-05"],
    "weekly_sales": [24924.50, 50605.27, 13740.12, 39954.04, 32229.38],
    "is_holiday": [False, False, False, False, False],
    "temp_c": [5.37, 5.37, 5.37, 5.37, 5.37],
    "fuel_price": [0.679, 0.679, 0.679, 0.679, 0.679],
    "unemp": [8.106, 8.106, 8.106, 8.106, 8.106]
}

# Summarizing numerical data
sales = pd.DataFrame(dict)
sales.head()

,store,type,dept,date_of_birth,weekly_sales,is_holiday,temp_c,fuel_price,unemp
0,1,A,1,2010-02-05,24924.50,False,5.37,0.679,8.106
1,1,A,2,2010-02-05,50605.27,False,5.37,0.679,8.106
2,1,A,3,2010-02-05,13740.12,False,5.37,0.679,8.106
3,1,A,4,2010-02-05,39954.04,False,5.37,0.679,8.106
4,1,A,5,2010-02-05,32229.38,False,5.37,0.679,8.106

In [45]:
# Print the head of the sales DataFrame
print(sales.head())

# Print the info about the sales DataFrame
print(sales.info())

# Print the mean of weekly_sales
print(sales["weekly_sales"].mean())

# Print the median of weekly_sales
print(sales["weekly_sales"].median())

   store type  dept date_of_birth  weekly_sales  is_holiday  temp_c  \
0      1    A     1    2010-02-05      24924.50       False    5.37
1      1    A     2    2010-02-05      50605.27       False    5.37
2      1    A     3    2010-02-05      13740.12       False    5.37
3      1    A     4    2010-02-05      39954.04       False    5.37
4      1    A     5    2010-02-05      32229.38       False    5.37

   fuel_price  unemp
0       0.679  8.106
1       0.679  8.106
2       0.679  8.106
3       0.679  8.106
4       0.679  8.106
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   store          5 non-null      int64
 1   type           5 non-null      object
 2   dept           5 non-null      int64
 3   date_of_birth  5 non-null      object
 4   weekly_sales   5 non-null      float64
 5   is_holiday     5 non-null      bool
 6   temp_c         5 non-null      float64
 7   fuel_price     5 non-null      float64
 8   unemp          5 non-null      float64
dtypes: bool(1), float64(4), int64(2), object(2)
memory usage: 453.0+ bytes
None
32290.662
32229.38

In [4]:
# Print the maximum of the date column
print(sales["date_of_birth"].max())

# Print the minimum of the date column
print(sales["date_of_birth"].min())

2010-02-05
2010-02-05

In [5]:
# Import NumPy and create custom IQR function
import numpy as np
def iqr(column):
    return column.quantile(0.75) - column.quantile(0.25)

# Update to print IQR and median of temperature_c, fuel_price_usd_per_l, & unemployment
print(sales[["temp_c", "fuel_price", "unemp"]].agg([iqr, np.median]))

        temp_c  fuel_price  unemp
iqr       0.00       0.000  0.000
median    5.37       0.679  8.106

In [6]:
# Sort sales_1_1 by date
#sales_1_1 = sales_1_1.sort_values("date", ascending=True)

# Get the cumulative sum of weekly_sales, add as cum_weekly_sales col
#sales_1_1["cum_weekly_sales"] = sales["weekly_sales"].cumsum()

# Get the cumulative max of weekly_sales, add as cum_max_sales col
#sales_1_1["cum_max_sales"] = sales["weekly_sales"].cummax()

# See the columns you calculated
#print(sales_1_1[["date", "weekly_sales", "cum_weekly_sales", "cum_max_sales"]])

## Counting

In [9]:
# Vet Visit
import pandas as pd

dict = {
    "date": ["2018-09-02", "2019-06-07", "2018-01-17", "2019-10-19", "2018-01-20", "2019-06-07", "2018-08-20", "2019-04-22"],
    "name": ["Bella", "Max", "Stella", "Lucy", "Stella", "Max", "Lucy", "Max"],
    "breed": ["Labrador", "Labrador", "Chihuahua", "Chow Chow", "Chihuahua", "Chow Chow", "Chow Chow", "Labrador"],
    "weight_kg": [24.87, 28.35, 1.51, 24.07, 2.83, 24.01, 24.40, 28.54]
}

# Summarizing numerical data
vet_visits = pd.DataFrame(dict)
vet_visits.head()

         date    name      breed  weight_kg
0  2018-09-02   Bella   Labrador      24.87
1  2019-06-07     Max   Labrador      28.35
2  2018-01-17  Stella  Chihuahua       1.51
3  2019-10-19    Lucy  Chow Chow      24.07
4  2018-01-20  Stella  Chihuahua       2.83

In [10]:
# Dropping duplicate names

vet_visits.drop_duplicates(subset="name")

         date    name      breed  weight_kg
0  2018-09-02   Bella   Labrador      24.87
1  2019-06-07     Max   Labrador      28.35
2  2018-01-17  Stella  Chihuahua       1.51
3  2019-10-19    Lucy  Chow Chow      24.07

In [11]:
# Dropping duplicate pairs

unique_dogs = vet_visits.drop_duplicates(subset=["name", "breed"])
print(unique_dogs)

         date    name      breed  weight_kg
0  2018-09-02   Bella   Labrador      24.87
1  2019-06-07     Max   Labrador      28.35
2  2018-01-17  Stella  Chihuahua       1.51
3  2019-10-19    Lucy  Chow Chow      24.07
5  2019-06-07     Max  Chow Chow      24.01

In [12]:
# Trick easy as 1,2,3
unique_dogs["breed"].value_counts()

Labrador     2
Chow Chow    2
Chihuahua    1
Name: breed, dtype: int64

In [13]:
unique_dogs["breed"].value_counts(sort=True)

Labrador     2
Chow Chow    2
Chihuahua    1
Name: breed, dtype: int64

In [14]:
# Proportions

unique_dogs["breed"].value_counts(normalize=True)

Labrador     0.4
Chow Chow    0.4
Chihuahua    0.2
Name: breed, dtype: float64

In [18]:
import pandas as pd

dict = {
    "store": [1, 1, 1, 1, 1],
    "type": ["A", "A", "A", "A", "A"],
    "dept": [1, 2, 3, 4, 5],
    "date_of_birth": ["2010-02-05", "2010-02-05", "2010-02-05", "2010-02-05", "2010-02-05"],
    "weekly_sales": [24924.50, 50605.27, 13740.12, 39954.04, 32229.38],
    "is_holiday": [False, False, False, False, False],
    "temp_c": [5.37, 5.37, 5.37, 5.37, 5.37],
    "fuel_price": [0.679, 0.679, 0.679, 0.679, 0.679],
    "unemp": [8.106, 8.106, 8.106, 8.106, 8.106]
}

# Summarizing numerical data
sales = pd.DataFrame(dict)
sales.head()

,store,type,dept,date_of_birth,weekly_sales,is_holiday,temp_c,fuel_price,unemp
0,1,A,1,2010-02-05,24924.50,False,5.37,0.679,8.106
1,1,A,2,2010-02-05,50605.27,False,5.37,0.679,8.106
2,1,A,3,2010-02-05,13740.12,False,5.37,0.679,8.106
3,1,A,4,2010-02-05,39954.04,False,5.37,0.679,8.106
4,1,A,5,2010-02-05,32229.38,False,5.37,0.679,8.106

In [ ]:
# Drop duplicate store/type combinations
store_types = sales.drop_duplicates(subset=["store", "type"])
print(store_types.head())

# Drop duplicate store/department combinations
store_depts = sales.drop_duplicates(subset=["store", "department"])
print(store_depts.head())

# Subset the rows where is_holiday is True and drop duplicate dates
holiday_dates = sales[sales["is_holiday"]==True].drop_duplicates(subset="date")

# Print date col of holiday_dates
print(holiday_dates["date"])

In [19]:
# Count the number of stores of each type
#store_counts = store_types["type"].value_counts()
#print(store_counts)

# Get the proportion of stores of each type
#store_props = store_types["type"].value_counts(normalize=True)
#print(store_props)

# Count the number of each department number and sort
#dept_counts_sorted = store_depts["department"].value_counts(sort=True)
#print(dept_counts_sorted)

# Get the proportion of departments of each number and sort
#dept_props_sorted = store_depts["department"].value_counts(sort=True, normalize=True)
#print(dept_props_sorted)

In [22]:
dict = {
    "name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "White"],
    "height_cm": [56, 43, 46, 49, 59, 18, 77],
    "weight_kg": [25, 23, 22, 17, 29, 2, 74],
    "date_of_birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

# Summarizing numerical data
dogs = pd.DataFrame(dict)

In [23]:
# Grouped summary statistics
print(dogs[dogs["color"] == "Black"]["weight_kg"].mean())
print(dogs[dogs["color"] == "Brown"]["weight_kg"].mean())
print(dogs[dogs["color"] == "White"]["weight_kg"].mean())
print(dogs[dogs["color"] == "Gray"]["weight_kg"].mean())
print(dogs[dogs["color"] == "Tan"]["weight_kg"].mean())

26.0
23.5
74.0
17.0
2.0

In [24]:
# Grouped summaries
dogs.groupby("color")["weight_kg"].mean()

color
Black    26.0
Brown    23.5
Gray     17.0
Tan       2.0
White    74.0
Name: weight_kg, dtype: float64

In [25]:
# Multiple grouped summaries
dogs.groupby("color")["weight_kg"].agg([min, max, sum])

       min  max  sum
color
Black   23   29   52
Brown   22   25   47
Gray    17   17   17
Tan      2    2    2
White   74   74   74

In [27]:
# Grouping by multiple variables
dogs.groupby(["color", "breed"])["weight_kg", "height_cm"].mean()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8784\2989938337.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  dogs.groupby(["color", "breed"])["weight_kg", "height_cm"].mean()

                   weight_kg  height_cm
color breed
Black Labrador          29.0       59.0
      Poodle            23.0       43.0
Brown Chow Chow         22.0       46.0
      Labrador          25.0       56.0
Gray   Schnauzer        17.0       49.0
Tan   Chihuahua          2.0       18.0
White St. Bernard       74.0       77.0

In [ ]:
# Calc total weekly sales
sales_all = sales["weekly_sales"].sum()

# Subset for type A stores, calc total weekly sales
sales_A = sales[sales["type"] == "A"]["weekly_sales"].sum()

# Subset for type B stores, calc total weekly sales
sales_B = sales[sales["type"] == "B"]["weekly_sales"].sum()

# Subset for type C stores, calc total weekly sales
sales_C = sales[sales["type"] == "C"]["weekly_sales"].sum()

# Get proportion for each type
sales_propn_by_type = [sales_A, sales_B, sales_C] / sales_all
print(sales_propn_by_type)

In [ ]:
# Group by type; calc total weekly sales
sales_by_type = sales.groupby("type")["weekly_sales"].sum()

# Get proportion for each type
sales_propn_by_type = sales_by_type / sum(sales_by_type)
print(sales_propn_by_type)

In [ ]:
# Import numpy with the alias np
import numpy as np

# For each store type, aggregate weekly_sales: get min, max, mean, and median
sales_stats = sales.groupby("type")["weekly_sales"].agg([np.min, np.max, np.mean, np.median])

# Print sales_stats
print(sales_stats)

# For each store type, aggregate unemployment and fuel_price_usd_per_l: get min, max, mean, and median
unemp_fuel_stats = sales.groupby("type")["unemployment", "fuel_price_usd_per_l"].agg([np.min, np.max, np.mean, np.median])

# Print unemp_fuel_stats
print(unemp_fuel_stats)

## Pivot Tables

In [30]:
# Group by to pivot table
dogs.groupby("color")["weight_kg"].mean()

# can use the same thing
dogs.pivot_table(values="weight_kg", 
                 index="color")

       weight_kg
color
Black       26.0
Brown       23.5
Gray        17.0
Tan          2.0
White       74.0

In [31]:
# Different statistics
import numpy as np
dogs.pivot_table(values="weight_kg", index="color", aggfunc=np.median)

       weight_kg
color
Black       26.0
Brown       23.5
Gray        17.0
Tan          2.0
White       74.0

In [32]:
# Different statistics
import numpy as np
dogs.pivot_table(values="weight_kg", index="color", aggfunc=[np.median, np.mean])

         median      mean
      weight_kg weight_kg
color
Black      26.0      26.0
Brown      23.5      23.5
Gray       17.0      17.0
Tan         2.0       2.0
White      74.0      74.0

In [33]:
# Pivot on two variables
dogs.groupby(["color", "breed"])["weight_kg"].mean()

# can use different thing
dogs.pivot_table(values="weight_kg", index="color", columns="breed")

breed   Schnauzer  Chihuahua  Chow Chow  Labrador  Poodle  St. Bernard
color
Black         NaN        NaN        NaN      29.0    23.0          NaN
Brown         NaN        NaN       22.0      25.0     NaN          NaN
Gray         17.0        NaN        NaN       NaN     NaN          NaN
Tan           NaN        2.0        NaN       NaN     NaN          NaN
White         NaN        NaN        NaN       NaN     NaN         74.0

In [35]:
# Filling missing values in pivot tables
dogs.pivot_table(values="weight_kg", index="color", columns="breed", fill_value=0)

breed   Schnauzer  Chihuahua  Chow Chow  Labrador  Poodle  St. Bernard
color
Black           0          0          0        29      23            0
Brown           0          0         22        25       0            0
Gray           17          0          0         0       0            0
Tan             0          2          0         0       0            0
White           0          0          0         0       0           74

In [38]:
# FSumming with pivot tables
dogs.pivot_table(values="weight_kg", index="color", columns="breed", fill_value=0, margins=True)

breed,Schnauzer,Chihuahua,Chow Chow,Labrador,Poodle,St. Bernard,All
color,,,,,,,
Black,0,0,0,29,23,0,26.000000
Brown,0,0,22,25,0,0,23.500000
Gray,17,0,0,0,0,0,17.000000
Tan,0,2,0,0,0,0,2.000000
White,0,0,0,0,0,74,74.000000
All,17,2,22,27,23,74,27.428571

In [ ]:
# Pivot for mean weekly_sales by store type and holiday 
mean_sales_by_type_holiday = sales.pivot_table(values='weekly_sales', index='type', columns='is_holiday')

# Print mean_sales_by_type_holiday
print(mean_sales_by_type_holiday)

In [ ]:
# Print the mean weekly_sales by department and type; fill missing values with 0s; sum all rows and cols
print(sales.pivot_table(values="weekly_sales", index="department", columns="type", fill_value=0, margins=True))

# Chapter 3

## Explicit Indexes

In [40]:
dict = {
    "name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "White"],
    "height_cm": [56, 43, 46, 49, 59, 18, 77],
    "weight_kg": [25, 23, 22, 17, 29, 2, 74],
    "date_of_birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

# Summarizing numerical data
dogs = pd.DataFrame(dict)

dogs.head()

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         25    2013-07-01
1  Charlie      Poodle  Black         43         23    2016-09-16
2     Lucy   Chow Chow  Brown         46         22    2014-08-25
3   Cooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-20

In [41]:
# .columns and index
print(dogs.columns)
print(dogs.index)

Index(['name', 'breed', 'color', 'height_cm', 'weight_kg', 'date_of_birth'], dtype='object')
RangeIndex(start=0, stop=7, step=1)

In [42]:
# Setting a column as the index
dogs_ind = dogs.set_index("name")
print(dogs_ind)

               breed  color  height_cm  weight_kg date_of_birth
name
Bella       Labrador  Brown         56         25    2013-07-01
Charlie       Poodle  Black         43         23    2016-09-16
Lucy       Chow Chow  Brown         46         22    2014-08-25
Cooper     Schnauzer   Gray         49         17    2011-12-11
Max         Labrador  Black         59         29    2017-01-20
Stella     Chihuahua    Tan         18          2    2015-04-20
Bernie   St. Bernard  White         77         74    2018-02-27

In [43]:
# Dropping an index
dogs_ind.reset_index(drop=True)

         breed  color  height_cm  weight_kg date_of_birth
0     Labrador  Brown         56         25    2013-07-01
1       Poodle  Black         43         23    2016-09-16
2    Chow Chow  Brown         46         22    2014-08-25
3    Schnauzer   Gray         49         17    2011-12-11
4     Labrador  Black         59         29    2017-01-20
5    Chihuahua    Tan         18          2    2015-04-20
6  St. Bernard  White         77         74    2018-02-27

In [44]:
# Indexes make subsetting simpler
dogs[dogs['name'].isin(['Bella', 'Stella'])]

     name      breed  color  height_cm  weight_kg date_of_birth
0   Bella   Labrador  Brown         56         25    2013-07-01
5  Stella  Chihuahua    Tan         18          2    2015-04-20

In [45]:
# Setting a column as the index
dogs_ind = dogs.set_index("name")
dogs_ind.loc[['Bella', 'Stella']]

            breed  color  height_cm  weight_kg date_of_birth
name
Bella    Labrador  Brown         56         25    2013-07-01
Stella  Chihuahua    Tan         18          2    2015-04-20

In [46]:
# Index values don't need to be unique
dogs_ind2 = dogs.set_index('breed')
print(dogs_ind2)

                name  color  height_cm  weight_kg date_of_birth
breed
Labrador       Bella  Brown         56         25    2013-07-01
Poodle       Charlie  Black         43         23    2016-09-16
Chow Chow       Lucy  Brown         46         22    2014-08-25
 Schnauzer    Cooper   Gray         49         17    2011-12-11
Labrador         Max  Black         59         29    2017-01-20
Chihuahua     Stella    Tan         18          2    2015-04-20
St. Bernard   Bernie  White         77         74    2018-02-27

In [47]:
# Subsetting on duplicated index values
dogs_ind2.loc["Labrador"]

           name  color  height_cm  weight_kg date_of_birth
breed
Labrador  Bella  Brown         56         25    2013-07-01
Labrador    Max  Black         59         29    2017-01-20

In [48]:
# Multi-level indexes a.k.a hierarchical indexes
dogs_ind3 = dogs.set_index(["breed", "color"])
print(dogs_ind3)

                      name  height_cm  weight_kg date_of_birth
breed       color
Labrador    Brown    Bella         56         25    2013-07-01
Poodle      Black  Charlie         43         23    2016-09-16
Chow Chow   Brown     Lucy         46         22    2014-08-25
 Schnauzer  Gray    Cooper         49         17    2011-12-11
Labrador    Black      Max         59         29    2017-01-20
Chihuahua   Tan     Stella         18          2    2015-04-20
St. Bernard White   Bernie         77         74    2018-02-27

In [49]:
# Subset the outer level with a list
dogs_ind3.loc[["Labrador", "Chihuahua"]]

                   name  height_cm  weight_kg date_of_birth
breed     color
Labrador  Brown   Bella         56         25    2013-07-01
          Black     Max         59         29    2017-01-20
Chihuahua Tan    Stella         18          2    2015-04-20

In [50]:
# Subset inner levels with a list of tuples
dogs_ind3.loc[[("Labrador", "Brown"), ("Chihuahua", "Tan")]]

                   name  height_cm  weight_kg date_of_birth
breed     color
Labrador  Brown   Bella         56         25    2013-07-01
Chihuahua Tan    Stella         18          2    2015-04-20

In [53]:
# Sorting by index values
dogs_ind3.sort_index()

                      name  height_cm  weight_kg date_of_birth
breed       color
 Schnauzer  Gray    Cooper         49         17    2011-12-11
Chihuahua   Tan     Stella         18          2    2015-04-20
Chow Chow   Brown     Lucy         46         22    2014-08-25
Labrador    Black      Max         59         29    2017-01-20
            Brown    Bella         56         25    2013-07-01
Poodle      Black  Charlie         43         23    2016-09-16
St. Bernard White   Bernie         77         74    2018-02-27

In [54]:
# Controlling sort_index
dogs_ind3.sort_index(level=['color', 'breed'], ascending=[True, False])

                      name  height_cm  weight_kg date_of_birth
breed       color
Poodle      Black  Charlie         43         23    2016-09-16
Labrador    Black      Max         59         29    2017-01-20
            Brown    Bella         56         25    2013-07-01
Chow Chow   Brown     Lucy         46         22    2014-08-25
 Schnauzer  Gray    Cooper         49         17    2011-12-11
Chihuahua   Tan     Stella         18          2    2015-04-20
St. Bernard White   Bernie         77         74    2018-02-27

In [55]:
dict = {
    "date": ["2000-01-01", "2000-02-01", "2000-03-01", "2000-04-01", "2000-05-01"],
    "city": ["Abidjan", "Abidjan", "Abidjan", "Abidjan", "Abidjan"],
    "country": ["Cote D'lvoire", "Cote D'lvoire", "Cote D'lvoire", "Cote D'lvoire", "Cote D'lvoire"],
    "avg_temp_c": [27.293, 27.685, 29.061, 28.162, 27.547]
}

# Summarizing numerical data
temperatures = pd.DataFrame(dict)

temperatures.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Cote D'lvoire      27.293
1  2000-02-01  Abidjan  Cote D'lvoire      27.685
2  2000-03-01  Abidjan  Cote D'lvoire      29.061
3  2000-04-01  Abidjan  Cote D'lvoire      28.162
4  2000-05-01  Abidjan  Cote D'lvoire      27.547

In [ ]:
dict = {
    "name": ["Bella", "Charlie", "Lucy", "Cooper", "Max", "Stella", "Bernie"],
    "breed": ["Labrador", "Poodle", "Chow Chow", " Schnauzer", "Labrador", "Chihuahua", "St. Bernard"],
    "color": ["Brown", "Black", "Brown", "Gray", "Black", "Tan", "White"],
    "height_cm": [56, 43, 46, 49, 59, 18, 77],
    "weight_kg": [25, 23, 22, 17, 29, 2, 74],
    "date_of_birth": ["2013-07-01", "2016-09-16", "2014-08-25", "2011-12-11", "2017-01-20", "2015-04-20", "2018-02-27"]
}

# Summarizing numerical data
dogs = pd.DataFrame(dict)

dogs.head()